docs/modules/elfeed/freemacs-elfeed.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elfeed Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="description" content="This org-mode file contains an org-babel implementation of the .emacs or .emacs.d/init.el file." />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Elfeed Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1d87117">1. Elfeed</a></li>
</ul>
</div>
</div>



<div id="outline-container-org1d87117" class="outline-2">
<h2 id="org1d87117"><span class="section-number-2">1.</span> Elfeed</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/skeeto/elfeed">Elfeyed</a> is a feed reader for Emacs that has powerful search capabilities and is very fast.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">elfeed</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:commands</span> elfeed
  <span style="color: #1ea8fc;">:custom</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> elfeed-feeds
        '<span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"https://www.sciencedaily.com/rss/all.xml"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
All of the feeds in the Elfeed reader are set as a list passed to the <code>elfeed-feeds</code> variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> elfeed-feeds
      '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"https://www.sciencedaily.com/rss/all.xml"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/karthink/elfeed-tube">Elfeed Tube</a> is an extension to Elfeed that adds YouTube channels to the 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">elfeed-tube</span>
  <span style="color: #1ea8fc;">:straight</span> <span style="color: #ff2afc;">(</span>elfeed-tube <span style="color: #1ea8fc;">:host</span> github
                         <span style="color: #1ea8fc;">:repo</span> <span style="color: #7984D1;">"karthink/elfeed-tube"</span>
                         <span style="color: #1ea8fc;">:branch</span> <span style="color: #7984D1;">"master"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:after</span> elfeed
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">elfeed-tube-mpv</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>elfeed-tube-setup<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>elfeed-tube-add-feeds '<span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"https://www.youtube.com/c/inanutshell/"</span>
                           <span style="color: #7984D1;">"https://www.youtube.com/c/veritasium/"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Add subsriptions to Elfeed Tube using the <code>elfeed-tube-add-feeds</code> variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>elfeed-tube-add-feeds '<span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"https://www.youtube.com/c/inanutshell/"</span>
                         <span style="color: #7984D1;">"https://www.youtube.com/c/veritasium/"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Elfeed Tube requires mpv for watching videos in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">mpv</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t<span style="color: #1ea8fc;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-elfeed</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
